app/views/profiles/index.html.erb

SELECT "profiles".* FROM "profiles"
---
<br>
<% if Profile.exists?(user_id: current_user.id) %>