app/controllers/event_lists_controller.rb

SELECT "event_lists".* FROM "event_lists"  WHERE (lower(eventName) like '%eau claire%'
---
  def index
    if params[:q]
    @event_lists = EventList.find_all_by_query(params[:q])
    else
    @event_lists = EventList.all

INSERT INTO "event_lists" ("eventName", "eventDescription", "streetAddress", "City", "State", "Zip", "nbrOfRiders", "vehicleType", "PUstreetAddress", "PUCity", "PUState", "PUZip", "smokingAllowed", "createdBy", "eventDriver", "eventDate", "eventTime", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event_list = EventList.new(event_list_params)
    @event_list.createdBy = current_user.user

UPDATE "event_lists" SET "eventTime" = ?, "updated_at" = ? WHERE "event_lists"."id" = 1  [["eventTime", "2000-01-01 20:00:00.000000"], ["updated_at", "2017-10-03 00:06:38.796366"]]
---
  def update
    @event_list.update(event_list_params)

SELECT  "event_lists".* FROM "event_lists"  WHERE "event_lists"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_event_list
      @event_list = EventList.find(params[:id])