app/controllers/profiles_controller.rb

SELECT "profiles".* FROM "profiles"
---
  def index
    @profiles = Profile.all

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", 0]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 6]]
---
  def show
    @profile = Profile.by_user(current_user).find(params[:id])

INSERT INTO "profiles" ("username", "first_name", "last_name", "age", "street_address", "city", "state", "zip", "driver", "rider", "drivernrider", "smoker", "non_smoker", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @profile = Profile.new(profile_params)
    @profile.user = current_user
    respond_to do |format|
      if @profile.save

DELETE FROM "profiles" WHERE "profiles"."id" = ?  [["id", 2]]
---
  def destroy
    @profile.destroy

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_profile
      @profile = Profile.find(params[:id])