app/controllers/user_vehicles_controller.rb

SELECT "user_vehicles".* FROM "user_vehicles"
---
  def index
    @user_vehicles = UserVehicle.all

INSERT INTO "user_vehicles" ("username", "vehicleType", "vehicleColor", "maxRider", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["username", "luke"], ["vehicleType", "car"], ["vehicleColor", "red"], ["maxRider", 29999], ["created_at", "2017-10-05 02:14:11.086857"], ["updated_at", "2017-10-05 02:14:11.086857"]]
---
  def create
    @user_vehicle = UserVehicle.new(user_vehicle_params)

    respond_to do |format|
      if @user_vehicle.save

SELECT  "user_vehicles".* FROM "user_vehicles" WHERE "user_vehicles"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_user_vehicle
      @user_vehicle = UserVehicle.find(params[:id])